moodring_app_api/app/controllers/songs_controller.rb

  def index
    @songs = Song.all.reverse
---
SELECT "songs".* FROM "songs"

  def create
    @song = Song.new(song_params)

    if @song.save
---
INSERT INTO "songs" ("title", "mood", "img", "created_at", "updated_at", "artist") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "\"MySong\""], ["mood", "\"Chill\""], ["img", "\"catImage\""], ["created_at", "2020-07-11 01:06:46.424933"], ["updated_at", "2020-07-11 01:06:46.424933"], ["artist", "\"Me\""]]

  def update
    song = Song.find(params[:id])
    song.update(song_params)
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "This New Song"], ["updated_at", "2020-07-11 14:46:46.842077"], ["id", 1]]

  def destroy
    song = Song.destroy(params[:id])
---
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 17]]

    def set_song
      @song = Song.find(params[:id])
---
SELECT "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]